//Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
// let arr = [1, 2, 3, 4, 5];
// arr.splice(1,2);
// console.log(arr)

//Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].
// let arr1 = [1, 2, 3, 4, 5];
// arr1.splice(0,5, 2, 3, 4)
// console.log(arr1)

//Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// let arr2 = [1, 2, 3, 4, 5];
// arr2.splice(3, 0, 'a', 'b', 'c');
// console.log(arr2);

//Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// let arr3 = [1, 2, 3, 4, 5];
// arr3.splice(1, 4, 'a', 'b', 2, 3, 4, 'c', 5, 'e')
// console.log(arr3)


